{
    "version": "https://jsonfeed.org/version/1",
    "title": "Creemos en la Red",
    "description": "",
    "home_page_url": "http://creemosenlared.com",
    "feed_url": "http://creemosenlared.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Creemos en la Red"
    },
    "items": [
        {
            "id": "http://creemosenlared.com/primer-actividad-de-creemos-en-la-red-2020/",
            "url": "http://creemosenlared.com/primer-actividad-de-creemos-en-la-red-2020/",
            "title": "Primer Actividad de Creemos en la Red 2020!",
            "summary": "Hola! Felicitaciones a les participantes de la tercera edición de este curso,&hellip;",
            "content_html": "<p>Hola!</p>\n<p>Felicitaciones a les participantes de la tercera edición de este curso, primera versión completamente online.</p>\n<p>Gracias a las mentoras que ayudaron con la consigna de ingreso!</p>\n<p>Es hora de empezar a aprender en detalle que es esto del desarrollo web, el diseño de paginas web, HTML, CSS y demases. Pero primero vamos a empezar con una introducción a HTML y nuestras primeras lineas de HTML escritas a mano.</p>\n<p>La actividad consiste en:</p>\n<ul>\n<li>Ver los videos de la siguiente lista de reproducción: <a href=\"https://www.youtube.com/watch?v=5sOfh4AenHk&amp;list=PLjCOYDkvpGJeWKZf0sq-7sRS1g3oZLbvP\" target=\"_blank\" rel=\"noopener noreferrer\">Empezando con HTML</a></li>\n<li>Crear un nuevo directorio en su pagina personal de github (github.com/<strong><em>user</em></strong>/<strong><em>user</em></strong>.github.io) con el nombre que quieran, si no se les ocurre un nombre en particular pueden nombrarlo <strong>actividad-1</strong></li>\n<li>Crear dos paginas (archivos) dentro del directorio, uno llamado <strong>index.html</strong>, el otro puede tener cualquier nombre, si no se les ocurre uno pueden nombrarlo <strong>pagina.html</strong></li>\n<li>El contenido de las paginas es libre, solo tiene que contar con las siguientes condiciones:\n<ul>\n<li>Un enlace o imagen que use una dirección absoluta</li>\n<li>Un enlace o imagen que use una dirección relativa</li>\n<li>La pagina index.html tiene que tener un enlace a la otra pagina (pagina.html o el nombre que hayan elegido)</li>\n<li>Una de las paginas tiene que tener un titulo que no sea <strong>Mi Pagina</strong></li>\n</ul>\n</li>\n</ul>\n<p>La entrega se va a hacer usando <em>Issues</em> de Github, es una forma de reportar problemas, solicitudes o preguntas en un repositorio de Github, para eso creamos un repositorio en donde vamos a recibir las entregas, para entregar la actividad tienen que:</p>\n<ul>\n<li>Ir a <a href=\"https://github.com/CreemosEnLaRed/entregas/issues\">https://github.com/CreemosEnLaRed/entregas/issues</a></li>\n<li>Hacer click en el botón verde <strong>New issue</strong> que esta a la derecha</li>\n<li>Hacer click en el botón verde <strong>Get started</strong> a la derecha de la platilla <strong class=\"f4\">Entrega de Actividad</strong></li>\n<li>Cambiar la <em>Dirección de la actividad</em> por la direccion (URL) de su actividad</li>\n<li>Si tenes ganas, contestar las preguntas para que vayamos mejorando las actividades</li>\n<li>Si sos oyente del curso, responde que si a la pregunta<strong> Soy oyente?</strong></li>\n<li>Hacer click en el botón verde <strong>Submit new issue</strong></li>\n</ul>\n<p><strong>Importante: </strong>tanto la pagina que creen como la información en el issue de entrega son información publica que se puede encontrar fácilmente navegando o con un buscador.</p>\n<p>Tenerlo en cuenta con el contenido que creen, eviten poner información privada, también tenerlo en cuenta en la respuesta a las preguntas.</p>\n<p>Si prefieren darnos feedback por privado pueden usar mensajes privados en las redes sociales o mandarnos un mail.</p>\n<p> </p>\n<p>Video de la actividad:</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/7u2Qk2xQ9IE\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"allowfullscreen\"></iframe>",
            "author": {
                "name": "Creemos en la Red"
            },
            "tags": [
            ],
            "date_published": "2020-03-10T19:01:00+01:00",
            "date_modified": "2020-03-11T13:31:59+01:00"
        },
        {
            "id": "http://creemosenlared.com/consigna-de-ingreso-a-creemos-en-la-red-2020/",
            "url": "http://creemosenlared.com/consigna-de-ingreso-a-creemos-en-la-red-2020/",
            "title": "Consigna de ingreso a Creemos en la Red 2020",
            "summary": "Hola! Bienvenides a Creemos en la Red! En este curso vas a&hellip;",
            "content_html": "<p>Hola! Bienvenides a Creemos en la Red! En este curso vas a aprender los fundamentos de la programación de sitios web. Si algo no te sale, no te preocupes, las mentoras del grupo de Telegram están a disposición para responder tus consultas. Y recordá que los errores son parte del aprendizaje! Nadie nace sabiendo programar, pero todes podemos aprender.</p>\n<p>En este primer ejercicio, vas a crear una cuenta en Github. ¿Qué es GitHub? Es una página que nos permite organizar nuestros proyectos de programación usando algo llamado Git. ¿Y qué es Git? Los programas (ya sean páginas web, software, o lo que sea que escribamos con código) no se escriben de una sola vez y ya está. En general, lleva varios días de trabajo, correcciones, reescrituras y agregados hasta que llegamos a la versión “final” (y luego tenemos que mantenerla y corregir los bugs!). Git nos ayuda manteniendo un historial de todos los cambios que hicimos a nuestro proyecto, desde la primera línea que escribimos hasta la versión final, sin importar cuán compleja sea.</p>\n<p>También nos permite otra cosa muy importante que es colaborar con otras personas en un mismo proyecto. Si tienen cierta edad, se acuerdan cuando no existía google drive y teníamos que mandarnos archivos de word por mail para hacer un TP grupal (o juntarnos sí o sí la misma casa). Era muy incómodo! En ese sentido, Git es como un Google Drive para programadores: centraliza todos los aportes en una versión \"oficial\" del proyecto y así permite que varias personas trabajen en un mismo proyecto sin pisarse.</p>\n<p><br>Por eso, Git (y GitHub) son usados en casi todos los trabajos de programación. Esta herramienta te va a ser intensamente útil en tu vida profesional si trabajás con código. <br><br>Para este primer ejercicio, solamente tenés que hacerte una cuenta en GitHub. Más adelante nos iremos familiarizando con cómo funciona.</p>\n<p>Video de la consigna:</p>\n<p>  <iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/X02SCRqmBlk\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"allowfullscreen\"></iframe></p>\n<p>El primer paso es visitar el canal de <a href=\"https://www.youtube.com/channel/UC2aMPI6HqVakLiRnkImOShg/videos\" target=\"_blank\" rel=\"noopener noreferrer\">youtube de Creemos en la Red</a> (y suscribirse si tenes ganas :)</p>\n<p>Ver los siguientes videos:</p>\n<ul>\n<li><a href=\"https://www.youtube.com/watch?v=QKl0i2YSC6o\" target=\"_blank\" rel=\"noopener noreferrer\">Introducción a Bloques Web</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=ODjyWXUFa7M\" target=\"_blank\" rel=\"noopener noreferrer\">Crear Cuenta en Github</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=i2s2Zcw_8rA\" target=\"_blank\" rel=\"noopener noreferrer\">Verificando la Cuenta de Github</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=JuWwZ7k2CH8\" target=\"_blank\" rel=\"noopener noreferrer\">Creando nuestra pagina personal en github</a></li>\n<li><a href=\"https://www.youtube.com/watch?v=b5RtQ_QRcpE\">Creando nuestra pagina personal en github (resumen)</a></li>\n</ul>\n<p>Realizar las siguientes actividades:</p>\n<ul>\n<li>Crear su propia cuenta en github (como se muestra en el video <a href=\"https://www.youtube.com/watch?v=ODjyWXUFa7M\" target=\"_blank\" rel=\"noopener noreferrer\">Crear Cuenta en Github</a>)</li>\n<li>Crear una pagina usando <a href=\"http://creemosenlared.com/bloques-web/\" target=\"_blank\" rel=\"noopener noreferrer\">Bloques Web</a> (como se muestra en el video <a href=\"https://www.youtube.com/watch?v=QKl0i2YSC6o\" target=\"_blank\" rel=\"noopener noreferrer\">Introducción a Bloques Web</a>)</li>\n<li>Publicar la pagina como pagina personal en github  (como se muestra en los videos <a href=\"https://www.youtube.com/watch?v=JuWwZ7k2CH8\" target=\"_blank\" rel=\"noopener noreferrer\">Creando nuestra pagina personal en github</a> y <a href=\"https://www.youtube.com/watch?v=b5RtQ_QRcpE\">Creando nuestra pagina personal en github (resumen)</a>)</li>\n</ul>\n<p>La pagina puede ser una pagina personal, describiendo algun hobby, organizacion o tema de interes, o una propuesta para la pagina principal de Creemos en la Red.</p>\n<p>Entregable:</p>\n<ul>\n<li>Nombre de usuarie en Telegram</li>\n<li>Nombre de usuarie en github</li>\n<li>Link a pagina personal de github</li>\n</ul>\n<p>En breve les vamos a avisar por donde se realiza la entrega de la consigna.</p>\n<p>Cualquier duda, consultar en el canal de telegram.</p>\n<p>Exitos!</p>",
            "author": {
                "name": "Creemos en la Red"
            },
            "tags": [
            ],
            "date_published": "2020-02-22T14:54:58+01:00",
            "date_modified": "2020-02-24T10:33:11+01:00"
        }
    ]
}
